**Basic SQL Reminder Notes**

SELECT *

FROM *

WHERE *

"%" is wildcard for strings

"XOR" for one or other, but not both

ORDER BY [column name] asc/desc (asc/desc can be used after individual columns

ROUND works as we understand
--------

IN for lists Example:
-----
SELECT name FROM bbc
  WHERE name IN ('Sri Lanka', 'Ceylon',
                 'Persia',    'Iran')


**Multiple, indepnedent clauses are possible. Note the parentheses**

SELECT * FROM nobel

  WHERE subject IN ('physics')
  
  AND yr IN (1980)
  
  OR
  
  (subject IN ('chemistry')
  AND yr IN (1984))

ERD - Entity Relationship Diagram

In [37]:
%reload_ext sql
%sql sqlite:///test_capital_project.db

'Connected: @test_capital_project.db'

In [38]:
%%sql

DROP TABLE IF EXISTS balance_sheets;
DROP TABLE IF EXISTS business_units;
DROP TABLE IF EXISTS capital_buffers;
DROP TABLE IF EXISTS forecast_assumptions;

CREATE TABLE business_units (
    unit_id INTEGER PRIMARY KEY,
    unit_name TEXT NOT NULL
);

CREATE TABLE balance_sheets (
    entry_id INTERGER PRIMARY KEY,
    unit_id INTEGER NOT NULL,
    report_date DATE NOT NULL,
    assets FLOAT NOT NULL,
    liabilities FLOAT NOT NULL,
    FOREIGN KEY (unit_id) REFERENCES business_units(unit_id)
);

CREATE TABLE capital_buffers (
    buffer_id INTEGER PRIMARY KEY,
    unit_id INTEGER NOT NULL,
    min_capital_ratio FLOAT NOT NULL,
    FOREIGN KEY (unit_id) REFERENCES business_units(unit_id)
);

CREATE TABLE forecast_assumptions (
    assumption_id INTEGER PRIMARY KEY,
    scenario_name TEXT NOT NULL,
    asset_multiplier FLOAT NOT NULL,
    liab_multiplier FLOAT NOT NULL
);

 * sqlite:///test_capital_project.db
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [39]:
%%sql
INSERT INTO business_units (unit_id, unit_name) VALUES
(1, 'Retail Banking'),
(2, 'Commercial Lending'),
(3, 'Credit Cards'),
(4, 'Wealth Management');

 * sqlite:///test_capital_project.db
4 rows affected.

[]

In [40]:
%%sql
SELECT * FROM business_units

 * sqlite:///test_capital_project.db
Done.

[(1, 'Retail Banking'),
 (2, 'Commercial Lending'),
 (3, 'Credit Cards'),
 (4, 'Wealth Management')]

In [41]:
%%sql
INSERT INTO balance_sheets (entry_id, unit_id, report_date, assets, liabilities) VALUES
(1, 1, '2023-12-31', 5000000, 4000000),
(2, 2, '2023-12-31', 8000000, 7000000),
(3, 3, '2023-12-31', 6000000, 5500000),
(4, 4, '2023-12-31', 9000000, 7000000),
(5, 1, '2024-06-30', 5100000, 4100000),
(6, 2, '2024-06-30', 8200000, 7100000),
(7, 3, '2024-06-30', 6100000, 5600000),
(8, 4, '2024-06-30', 9100000, 7100000);

 * sqlite:///test_capital_project.db
8 rows affected.

[]

In [42]:
%%sql
SELECT * FROM balance_sheets

 * sqlite:///test_capital_project.db
Done.

[(1, 1, '2023-12-31', 5000000.0, 4000000.0),
 (2, 2, '2023-12-31', 8000000.0, 7000000.0),
 (3, 3, '2023-12-31', 6000000.0, 5500000.0),
 (4, 4, '2023-12-31', 9000000.0, 7000000.0),
 (5, 1, '2024-06-30', 5100000.0, 4100000.0),
 (6, 2, '2024-06-30', 8200000.0, 7100000.0),
 (7, 3, '2024-06-30', 6100000.0, 5600000.0),
 (8, 4, '2024-06-30', 9100000.0, 7100000.0)]

In [43]:
%%sql
INSERT INTO capital_buffers (buffer_id, unit_id, min_capital_ratio) VALUES
(1, 1, 0.10),
(2, 2, 0.12),
(3, 3, 0.08),
(4, 4, 0.11);

 * sqlite:///test_capital_project.db
4 rows affected.

[]

In [44]:
%%sql
SELECT * FROM capital_buffers

 * sqlite:///test_capital_project.db
Done.

[(1, 1, 0.1), (2, 2, 0.12), (3, 3, 0.08), (4, 4, 0.11)]

In [ ]:
%%sql
INSERT INTO forecast_assumptions (assumption_id, scenario_name, asset_multiplier, liab_multiplier) VALUES
(1, 'Baseline', 1.00, 1.00),
(2, 'Mild Recession', 0.95, 1.05),
(3, 'Severe Recession', 0.90, 1.10),
(4, 'Expansion', 1.10, 0.95);

In [ ]:
import pandas as pd

result = %sql SELECT * FROM balance_sheets
df = result.DataFrame()
df.head()